{"inkVersion":19,"root":[["^Greetings young man! How goes thee?","\n","ev","str","^Good, How about you?","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Buy this stuff.","/str","/ev",{"*":"0.c-1","flg":20},"ev","str","^I don't have time for this old man.","/str","/ev",{"*":"0.c-2","flg":20},"ev","str","^Quit","/str","/ev",{"*":"0.c-3","flg":20},{"c-0":["^I'm doing alright myself. How are you sir?","\n","^Oh, I'm not doing so well. I've been wandering the forest as I normally do and have seem to hurt my back. Not to be a bother though. I must get going or dinner is going to get cold.","\n",["ev","str","^It's the middle of the day","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I think I can help","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^Are you alright? It's midday right now and there is not a cottage in sight.","\n","^It's me joints sonny. They just aren't moving like they used to. If only there was something that could help me.","\n",["ev","str","^Buy my stuff.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^If it's your joints I may have a remedy right here. It's pretty rare, but I'm willing to cut you a deal.","\n",{"->":"SELLING"},{"->":"0.g-0"},{"#f":5}]}],{"#f":5}],"c-1":["^I see. Do you want some help?","\n","^Oh. No need to worry about me. Worry about yourself. How did you even end up here? This part of the forest is closed off from the outside.","\n",[["ev",{"^->":"0.c-0.4.c-1.4.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Wait what?",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"0.c-0.4.c-1.4.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^You heard me. Now back off before you become my next and possibly final meal.","\n","end",{"->":"0.g-0"},{"#f":5}]}],{"#f":5}]}],{"#f":5}],"c-1":["^I see that you do not feel like you did in your prime. I have the perfect rememdy for this. ","\n","^Eh, What else am I supposed to do?","\n",{"->":"SELLING"},{"->":"0.g-0"},{"#f":5}],"c-2":["^ I'm very buisy right now, I need to get going but can you do me a quick favour?","\n","^I do think you're being quite rude. What could you be doing right now that's so important that you cant help an old man in trouble?","\n",["ev","str","^No time, buy something","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I'm running from my wife","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^I do not have a lot of time left on this planet. You have to buy this thing.","\n","^No. I don't think I will.","\n","end",{"->":"0.g-0"},{"#f":5}],"c-1":["^I'm running away from my wife and am in desperate need of coin. Please buy something.","\n","^Ah. I see. I'm hiding from my wife right now. I guess I can help you out, just don't tell my wife.","\n",{"->":"SELLING"},{"->":"0.g-0"},{"#f":5}]}],{"#f":5}],"c-3":["^I need to get going now. Goodbye.","\n","end",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"SELLING":[["ev","str","^Buy this leaf.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Buy this potato","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ I have a rare herb with me from my travels. It grows only on the highest of mountains far in the north.","\n","^There are mountains in the north?","\n",["ev","str","^I meant south","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Nother than north","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^Did I say north? I meant south. The peaks of mountains in the south.","\n","^I don't belive there are mountains in the south either. As a matter of fact, there aren't mountains anywere in this land sonny.","\n","^Errrrr...","\n",["ev","str","^Run","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Buy something else","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^LOOK! A WORKING OPTIONS MENU!","\n","^Where?","\n","end",{"#f":5}],"c-1":["^Let me see what else I have.","\n","^It best be good","\n",{"->":"SELLING"},{"#f":5}]}],{"#f":5}],"c-1":["^Yes, if you travel very far.","\n","^Oh, my mistake. Continue.","\n",["ev","str","^Brew the leaf","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Eat the leaf","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^When brewed into a hot tea this herb can cure any of your stiff joints and you will wake up feeling as limber as that one really limber person.","\n","^Who?","\n","^You know. That guy.","\n","^What guy? We're the only ones here sonny.","\n","^Errrrr...","\n",["ev","str","^Run","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Buy something else","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^Let me go find that guy real quick.","\n","^If My joints worked then I would follow you but I guess I'm stuck here.","\n","end",{"#f":5}],"c-1":["^Let me see what else I have.","\n","^It best be good","\n",{"->":"SELLING"},{"#f":5}]}],{"#f":5}],"c-1":["^When consumed, this leaf will stop all joint pain for a week. You should be able to get home after this.","\n","^That sounds alright. But i only have 50 copper on me. Will that be enough?","\n",["ev","str","^Yes","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^MORE","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^That's a little low but it's ok. I'll take that.","\n","^Subarashi!! My joints feel better already!","\n","^what?","\n","^What?","\n","end",{"#f":5}],"c-1":["^It's going to take a bit more than that.","\n","^I don't have anything else young man. perhaps you can offer me something else?","\n",{"->":"SELLING"},{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}],"c-1":["^Here I hold a mystical stone of life. It bears many healing properties which must be activated.","\n","^How does it work?","\n",["ev","str","^Plant it","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Cook it","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Brew it","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^Legend has it that if you place this rock in a hole in the ground it will take root and using the power of the sun, create a herb with all of it's properties. Once purple flowers start to bloom, you should be able to dig it up and find new stones. The plant itself will heal you through it's magic aura. And theese new stones will also function just like the original.","\n","^That sounds great! But you see I only have 50 copper with me. I hope that will suffice.","\n",["ev","str","^Yes","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^MORE","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^That's a little low but it's ok. I'll take that.","\n","^I guess i'll have to go and get to work now. Thank you.","\n","end",{"#f":5}],"c-1":["^I'm afraid that's just not enough. Theese things are rare to come by. And if you're willing to put in the work you could make infinate numbers of them. I just can't let this go for so little.","\n","^If I had anything else I would offer it. Perhaps you can see if you have anything else?","\n",{"->":"SELLING"},{"#f":5}]}],{"#f":5}],"c-1":["^You should be able to introduce this stone into your meal. While it is a rock, it can be cut an peeled to show it's raw potential. Add it to your stew when you cook it and it's healing properties will bleed into your food.","\n","^I'm afraid that won't do. If my wife find something like this in our stew she will make me sleep outside for a week. I just can't take that risk. I'm sorry sonny but I can't buy that.","\n","end",{"#f":5}],"c-2":["^Peel the outer husk off of it and place it in a barrel with some yeast or something.","\n","^Like mead?","\n","^Yes. Just like mead.","\n","^So if I make this stone mead it will help all of my joints?","\n","^Or the legend goes.","\n","^I see what you're doing. You just want to poison me! You should know that stones have been placed in mead to poison it. If my joints didn't hurt so much right now you'd be in a world of pain sonny boy.","\n","end","end",{"#f":5}]}],{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}